duxinglang-1/nRF9160_test/JPR_TEST/src/screen/screen.c
		GetSleepTimeData(&deep_sleep, &light_sleep);
		LCD_SetFontSize(FONT_SIZE_16);
		LCD_MeasureString("TOTAL_SLEEP:        ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 100;
		LCD_ShowString(x,y,"TOTAL_SLEEP:        ");
		sprintf(tmpbuf, "%d (min)", deep_sleep+light_sleep);
		LCD_ShowString(x+13*FONT_SIZE_16/2, y, tmpbuf);

		LCD_MeasureString("DEEP_SLEEP:        ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 120;
		LCD_ShowString(x,y,"DEEP_SLEEP:        ");
		sprintf(tmpbuf, "%d (min)", deep_sleep);
		LCD_ShowString(x+12*FONT_SIZE_16/2, y, tmpbuf);

		LCD_MeasureString("LIGHT_SLEEP:        ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 140;
		LCD_ShowString(x,y,"LIGHT_SLEEP:        ");
		sprintf(tmpbuf, "%d (min)", deep_sleep);
		LCD_ShowString(x+13*FONT_SIZE_16/2, y, tmpbuf);
		break;
		
	case SCREEN_ACTION_UPDATE:
		GetSleepTimeData(&deep_sleep, &light_sleep);
		LCD_SetFontSize(FONT_SIZE_16);
		LCD_MeasureString("TOTAL_SLEEP:        ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 100;
		LCD_ShowString(x,y,"TOTAL_SLEEP:        ");
		sprintf(tmpbuf, "%d (min)", deep_sleep+light_sleep);
		LCD_ShowString(x+13*FONT_SIZE_16/2, y, tmpbuf);

		LCD_MeasureString("DEEP_SLEEP:        ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 120;
		LCD_ShowString(x,y,"DEEP_SLEEP:        ");
		sprintf(tmpbuf, "%d (min)", deep_sleep);
		LCD_ShowString(x+12*FONT_SIZE_16/2, y, tmpbuf);

		LCD_MeasureString("LIGHT_SLEEP:        ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 140;
		LCD_ShowString(x,y,"LIGHT_SLEEP:        ");
		sprintf(tmpbuf, "%d (min)", deep_sleep);
		LCD_ShowString(x+13*FONT_SIZE_16/2, y, tmpbuf);
		break;
	}
	
	scr_msg[SCREEN_ID_SLEEP].act = SCREEN_ACTION_NO;
}

void StepsScreenProcess(void)
{
	u16_t x,y,w,h;
	u16_t steps,calorie,distance;
	u8_t notify[64] = "Sport";
	u8_t tmpbuf[64] = {0};
	
	switch(scr_msg[SCREEN_ID_STEPS].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_STEPS].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_STEPS].status = SCREEN_STATUS_CREATED;
				
		LCD_Clear(BLACK);
		LCD_SetFontSize(FONT_SIZE_24);
		LCD_MeasureString(notify,&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 50;
		LCD_ShowString(x,y,notify);

		GetSportData(&steps, &calorie, &distance);
		LCD_SetFontSize(FONT_SIZE_16);
		
		LCD_MeasureString("Steps:     ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 100;
		LCD_ShowString(x, y, "Steps:     ");
		sprintf(tmpbuf, "%d", steps);
		LCD_ShowString(x+7*FONT_SIZE_16/2, y, tmpbuf);

		LCD_MeasureString("Distance:     ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 120;
		LCD_ShowString(x,y,"Distance:     ");
		sprintf(tmpbuf, "%d", distance);
		LCD_ShowString(x+10*FONT_SIZE_16/2, y, tmpbuf);

		LCD_MeasureString("Calorie:     ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 140;
		LCD_ShowString(x,y,"Calorie:     ");
		sprintf(tmpbuf, "%d", calorie);
		LCD_ShowString(x+9*FONT_SIZE_16/2, y, tmpbuf);		
		break;
		
	case SCREEN_ACTION_UPDATE:
		GetSportData(&steps, &calorie, &distance);
		LCD_SetFontSize(FONT_SIZE_16);
		
		LCD_MeasureString("Steps:     ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 100;
		LCD_ShowString(x, y, "Steps:     ");
		sprintf(tmpbuf, "%d", steps);
		LCD_ShowString(x+7*FONT_SIZE_16/2, y, tmpbuf);

		LCD_MeasureString("Distance:     ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 120;
		LCD_ShowString(x,y,"Distance:     ");
		sprintf(tmpbuf, "%d", distance);
		LCD_ShowString(x+10*FONT_SIZE_16/2, y, tmpbuf);

		LCD_MeasureString("Calorie:     ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 140;
		LCD_ShowString(x,y,"Calorie:     ");
		sprintf(tmpbuf, "%d", calorie);
		LCD_ShowString(x+9*FONT_SIZE_16/2, y, tmpbuf);
		break;
	}
	
	scr_msg[SCREEN_ID_STEPS].act = SCREEN_ACTION_NO;
}

void FallShowStatus(void)
{
#if 0
	u16_t x,y;
	u32_t img_addr;
	u8_t *img;

	LCD_Clear(BLACK);

	switch(global_settings.language)
	{
	case LANGUAGE_EN:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_FALL_EN_ADDR;
	#else
		img = IMG_FALL_EN;
	#endif
		x = FALL_EN_TEXT_X;
		y = FALL_CN_TEXT_Y;
		break;
		
	case LANGUAGE_CHN:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_FALL_CN_ADDR;
	#else
		img = IMG_FALL_CN;
	#endif
		x = FALL_CN_TEXT_X;
		y = FALL_CN_TEXT_Y;	
		break;
	}

#ifdef IMG_FONT_FROM_FLASH
	LCD_ShowImg_From_Flash(FALL_ICON_X, FALL_ICON_Y, IMG_FALL_ICON_ADDR);
	LCD_ShowImg_From_Flash(x, y, img_addr);
#else
	LCD_ShowImg(FALL_ICON_X, FALL_ICON_Y, IMG_FALL_ICON);
	LCD_ShowImg(x, y, img);
#endif
#endif
}

void FallScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_FALL].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_FALL].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_FALL].status = SCREEN_STATUS_CREATED;

		FallShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		break;
	}
	
	scr_msg[SCREEN_ID_FALL].act = SCREEN_ACTION_NO;
}
#endif

#ifdef CONFIG_FOTA_DOWNLOAD
void FOTAShowStatus(void)
{
	u16_t x,y,w,h;
	u8_t str_title[] = "FOTA RUNNING";
	
	LCD_DrawRectangle(FOTA_NOTIFY_RECT_X, FOTA_NOTIFY_RECT_Y, FOTA_NOTIFY_RECT_W, FOTA_NOTIFY_RECT_H);
	LCD_Fill(FOTA_NOTIFY_RECT_X+1, FOTA_NOTIFY_RECT_Y+1, FOTA_NOTIFY_RECT_W-1, FOTA_NOTIFY_RECT_H-1, BLACK);
	
	LCD_SetFontSize(FONT_SIZE_16);
	LCD_MeasureString(str_title, &w, &h);
	x = (w > (FOTA_NOTIFY_RECT_W-2*FOTA_NOTIFY_OFFSET_W))? 0 : ((FOTA_NOTIFY_RECT_W-2*FOTA_NOTIFY_OFFSET_W)-w)/2;
	x += (FOTA_NOTIFY_RECT_X+FOTA_NOTIFY_OFFSET_W);
	y = FOTA_NOTIFY_RECT_Y+2;
	LCD_ShowString(x,y,str_title);

	ShowStringsInRect(FOTA_NOTIFY_STRING_X, 
					  FOTA_NOTIFY_STRING_Y, 
					  FOTA_NOTIFY_STRING_W, 
					  FOTA_NOTIFY_STRING_H, 
					  FONT_SIZE_16, 
					  "Make sure the battery is sufficient and do not do anything during the upgrade!");

	LCD_DrawRectangle(FOTA_NOTIFY_YES_X, FOTA_NOTIFY_YES_Y, FOTA_NOTIFY_YES_W, FOTA_NOTIFY_YES_H);
	LCD_MeasureString("SOS(Y)", &w, &h);
	x = FOTA_NOTIFY_YES_X+(FOTA_NOTIFY_YES_W-w)/2;
	y = FOTA_NOTIFY_YES_Y+(FOTA_NOTIFY_YES_H-h)/2;	
	LCD_ShowString(x,y,"SOS(Y)");

	LCD_DrawRectangle(FOTA_NOTIFY_NO_X, FOTA_NOTIFY_NO_Y, FOTA_NOTIFY_NO_W, FOTA_NOTIFY_NO_H);
	LCD_MeasureString("PWR(N)", &w, &h);
	x = FOTA_NOTIFY_NO_X+(FOTA_NOTIFY_NO_W-w)/2;
	y = FOTA_NOTIFY_NO_Y+(FOTA_NOTIFY_NO_H-h)/2;	
	LCD_ShowString(x,y,"PWR(N)");

	Key_Event_register_Handler(fota_start_confirm, ExitFotaScreen);
#ifdef CONFIG_TOUCH_SUPPORT
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, FOTA_NOTIFY_YES_X, FOTA_NOTIFY_YES_X+FOTA_NOTIFY_YES_W, FOTA_NOTIFY_YES_Y, FOTA_NOTIFY_YES_Y+FOTA_NOTIFY_YES_H, fota_start_confirm);
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, FOTA_NOTIFY_NO_X, FOTA_NOTIFY_NO_X+FOTA_NOTIFY_NO_W, FOTA_NOTIFY_NO_Y, FOTA_NOTIFY_NO_Y+FOTA_NOTIFY_NO_H, ExitFotaScreen);
#endif
	
